app/views/users/_likeModal.html.haml

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
        - p.likes.each do |l|
          = link_to User.find(l.likeUser).name, "/profile/#{User.find(l.likeUser).name}"