app/views/users/_likeModal.html.haml

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 6]]
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 9]]
---
:javascript
  $(document).ready(function(){
    $(".showlike").click(function(){
      var input = this.id.split(" ");
      var postID = input[0];
      var postLikeby = $(input[1]).text().split(",");
      for (var i = 0; i < input.length; i++){
        var postfix = '<a href='
        var templink = '/profile/'+postLikeby[i]+'>';
        var link = templink.replace(/\s/g, '');
        var tempname = postLikeby[i]
        var name = postLikeby[i].replace(/\s/g, '');
        var suffix = '</a></br>'
        postLikeby[i] = postfix+link+name+suffix;
      }
      $("#showlikeLabel").text("post"+postID);
      $("#showlikeBodyText").html(postLikeby);
      $("#showlike").modal("toggle");
    });
  });