app/views/users/feed.html.haml

          .d-flex.p-2.border.border-primary.rounded
            Username : #{User.find(post.user_id).name}
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]

            %p{id:"likeby#{post.id}", hidden:""}
              - post.likes.each do |pl|
                = User.find(pl.likeUser).name + ","
          .col
            %button.btn.btn-primary.showlike{type: "button", id:"#{post.id} #likeby#{post.id}"} Show like
            - if Like.find_by(post_id: post.id,likeUser: session[:user_id]) == nil
---
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 9]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = ? AND "likes"."likeUser" = ? LIMIT ?  [["post_id", 9], ["likeUser", "5"], ["LIMIT", 1]]

:javascript
  $(document).ready(function(){
    $(".showlike").click(function(){
      var input = this.id.split(" ");
      var postID = input[0];
      var postLikeby = $(input[1]).text().split(",");
      for (var i = 0; i < input.length; i++){
        var postfix = '<a href='
        var templink = '/profile/'+postLikeby[i]+'>';
        var link = templink.replace(/\s/g, '');
        var tempname = postLikeby[i]
        var name = postLikeby[i].replace(/\s/g, '');
        var suffix = '</a></br>'
        postLikeby[i] = postfix+link+name+suffix;
      }
      $("#showlikeLabel").text("post"+postID);
      $("#showlikeBodyText").html(postLikeby);
      $("#showlike").modal("toggle");
    });
  });
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 6]]