app/views/users/view_profile.html.haml

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 6]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 4]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = ? AND "likes"."likeUser" = ? LIMIT ?  [["post_id", 4], ["likeUser", "5"], ["LIMIT", 1]]
---
    .col
      - User.find(@user.id).posts.each do |post|
        .d-flex.p-2.border.border-primary.rounded Username : #{@profileName} <br> Message : #{post.msg} <br> Created-at : #{post.created_at} <br> Updated-at : #{post.updated_at}
        %p{id:"likeby#{post.id}", hidden:""}
          - post.likes.each do |pl|
            = User.find(pl.likeUser).name + ","
        .col
          %button.btn.btn-primary.showlike{type: "button", id:"#{post.id} #likeby#{post.id}"} Show like
          - if Like.find_by(post_id: post.id,likeUser: session[:user_id]) == nil

SELECT "follows".* FROM "follows" WHERE "follows"."follower_id" = ? AND "follows"."followee_id" = ? LIMIT ?  [["follower_id", 5], ["followee_id", 5], ["LIMIT", 1]]
---
        .form-actions
          - if Follow.find_by(follower_id: session[:user_id], followee: @user.id) == nil