app/controllers/posts_controller.rb

INSERT INTO "posts" ("user_id", "msg", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 5], ["msg", ""], ["created_at", "2021-10-13 18:35:47.265466"], ["updated_at", "2021-10-13 18:35:47.265466"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "msg" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["msg", "asdasdas"], ["updated_at", "2021-10-13 18:24:00.119910"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)