app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "asad"], ["LIMIT", 1]]
---
  def recieve_login_info
  	@commit = params[:commit]
  	@loginEmail = params[:user][:email]
	@loginPassword = params[:user][:password]
  	if(@commit == 'Login')
		@usermatch = false
		@find = User.find_by(email:@loginEmail)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def feed
	@user = User.find(session[:user_id])

SELECT "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "a"], ["LIMIT", 1]]
SELECT "follows".* FROM "follows" WHERE "follows"."follower_id" = ? AND "follows"."followee_id" = ? LIMIT ?  [["follower_id", 5], ["followee_id", 5], ["LIMIT", 1]]
---
  def view_profile
	@profileName = params[:name]
	@user = User.find_by(name:@profileName)
	puts(session[:user_id])
	puts(@user.id)
	puts(Follow.find_by(follower_id: session[:user_id], followee: @user.id) == nil)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
INSERT INTO "follows" ("follower_id", "followee_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["follower_id", 5], ["followee_id", 6], ["created_at", "2021-10-13 20:59:17.121222"], ["updated_at", "2021-10-13 20:59:17.121222"]]
DELETE FROM "follows" WHERE "follows"."id" = ?  [["id", 6]]
SELECT "follows".* FROM "follows" WHERE "follows"."follower_id" = ? AND "follows"."followee_id" = ? LIMIT ?  [["follower_id", 5], ["followee_id", 6], ["LIMIT", 1]]
---
  def follow_info
	@commit = params[:commit]
  	@follower_id = User.find(session[:user_id]).id
  	@followee_id = params[:follow][:followee_id]
  	if(@commit == 'Follow')
  		f = Follow.create(:follower_id => @follower_id, :followee_id => @followee_id)
  	elsif(@commit == 'Unfollow')
  		Follow.find_by(follower_id: @follower_id, followee: @followee_id).destroy

INSERT INTO "likes" ("post_id", "likeUser", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["post_id", 9], ["likeUser", "5"], ["created_at", "2021-10-31 14:15:06.841689"], ["updated_at", "2021-10-31 14:15:06.841689"]]
---
  def likepost
  	@pid = params[:pid]
  	Like.create(post_id: @pid, likeUser: session[:user_id])

DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 2]]
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = ? AND "likes"."likeUser" = ? LIMIT ?  [["post_id", 9], ["likeUser", "5"], ["LIMIT", 1]]
---
  def unlikepost
  	@pid = params[:pid]
  	Like.find_by(post_id: @pid,likeUser: session[:user_id]).destroy