app/models/user.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 6]]
---
  def get_feed_post
  	@user = self
  	@allpost = Array.new
  	User.find(@user.id).followees.each do |followee|
		followee.posts.each do |post|